src/test/jmeter/High_priority_API.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">accept</stringProp>
            <stringProp name="Header.value">application/json, text/plain, */*</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">authorization</stringProp>
            <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6IjJaUXBKM1VwYmpBWVhZR2FYRUpsOGxWMFRPSSJ9.eyJhdWQiOiI4MzAzNDM0ZC1jMGU2LTQxYWItYjVlMy04ZmMxNjNiZWNjNjYiLCJpc3MiOiJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vYjdhYTQzMDgtYmYzMy00MTRmLTk5NzEtNmUwYzk3MmNiZTVkL3YyLjAiLCJpYXQiOjE2Njk3ODIxMTQsIm5iZiI6MTY2OTc4MjExNCwiZXhwIjoxNjY5Nzg2MDE0LCJhaW8iOiJBV1FBbS84VEFBQUFJcHJ6MW9TdUZvMWNnNVcwRUxnL3N6NTZUb0cxOXh4ekRaQ2lRdHZCK1BrV2xZOUpNYWM4M1NVbklIUkZqZ1Q1MW5HM0x0SCtIZkd2T2R0TTdpbkp4eElSM0tCUjVMK0NXOVZ6T3hKcnBoSFdJK3pwL2o4MGhzekQ0UmhxUWJXViIsImN0cnkiOiJVUyIsImVtYWlsIjoiS2FuY2hhbi5QYXRpbEBzeXNjby5jb20iLCJmYW1pbHlfbmFtZSI6IlBhdGlsIiwiZ2l2ZW5fbmFtZSI6IkthbmNoYW4iLCJncm91cHMiOlsiNjkxOTBhZjYtNTgzYi00OTg4LWE3OTMtNzM5MTNkYjM0YmU1Il0sIm5hbWUiOiJQYXRpbCwgS2FuY2hhbiIsIm5vbmNlIjoiOGUzNzNlZTAtY2IwMi00MzdiLWE0ZjMtNDM4ZGRiZWJlNzgzIiwib2lkIjoiMDNiZmZmNDUtNjg0Ni00OGY5LWI3ZWYtOGNiOWU1ZGJmOTZmIiwicHJlZmVycmVkX3VzZXJuYW1lIjoia3BhdDg5NDNAY29ycC5zeXNjby5jb20iLCJyaCI6IjAuQVFNQUNFT3F0ek9fVDBHWmNXNE1seXktWFUxREE0UG13S3RCdGVPUHdXTy16R1lEQUhzLiIsInN1YiI6IkJtbG1veTEwcG5TREpyOGZzWUhRaXRlQVQyZEFZUUlqMGZiOWRYWi1IczQiLCJ0aWQiOiJiN2FhNDMwOC1iZjMzLTQxNGYtOTk3MS02ZTBjOTcyY2JlNWQiLCJ1cG4iOiJrcGF0ODk0M0Bjb3JwLnN5c2NvLmNvbSIsInV0aSI6ImpTcjVVcEJzNEVDRGN3aXpYWU15QUEiLCJ2ZXIiOiIyLjAifQ.QioqrJsYxCqVKa9np0iJfksTBnBjex0Fzp2httXYXjbOnvOtOMQI8ty-HanVh5KwnZdkdq4p7ea9vXFl_XaY4klwilMEglbaD0Q4AYnVDvSFtFmrvy2Y1VDcpNx-VOqZwmdoMNcaPMmQIwEhz4p3qtizsv4LMYAoXil6mN5Pjf9rQGxLT4pShXRGVEFf-HjmRSBoQFUFQ39U0UMzLX8zbVbMbGyGVavfsgAciJbpxybuqJ3LV9tuHTalYTRJGp9T4_Fif5fy6BgSQdmC7cd_Y-yJFoiGnp5JSLnZHdQCg62MkQPqaRO1VHOzxhtyqnVYJk9zc28SCx1hVPOP3rFi6A</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV_POST_SearchParent" enabled="true">
        <stringProp name="filename">/opt/perf-test-data/searchParent.csv</stringProp>
        <stringProp name="variableNames">opco,parent,DESC,Typ </stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="quotedData">true</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1478801752">
            <stringProp name="1567">10</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="48687">120</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Transaction Controller" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST_17_searchParent" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;opco&quot;: &quot;${opco}&quot;,&#xd;
  &quot;parent&quot;: &quot;${parent}&quot;,&#xd;
  &quot;description&quot;: &quot;${DESC}&quot;,&#xd;
  &quot;type&quot;: &quot;${Typ}&quot;,&#xd;
  &quot;hierarchy&quot;: &quot;D&quot;,&#xd;
  &quot;pageNum&quot;: 1,&#xd;
  &quot;pageSize&quot;: 1&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">api-dd-stg.pricing-crm-nonprod.us-east-1.aws.sysco.net</stringProp>
            <stringProp name="HTTPSampler.protocol">https</stringProp>
            <stringProp name="HTTPSampler.path">/digitalDeals/customerGroupMapping/searchParent</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">16</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>